betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Include/apm32f4xx_dal_can.h
} DAL_CAN_CallbackIDTypeDef;

/**
  * @brief  DAL CAN Callback pointer definition
  */
typedef  void (*pCAN_CallbackTypeDef)(CAN_HandleTypeDef *hcan); /*!< pointer to a CAN callback function   */

#endif /* USE_DAL_CAN_REGISTER_CALLBACKS */
/**
  * @}
  */

/* Exported constants --------------------------------------------------------*/

/** @defgroup CAN_Exported_Constants CAN Exported Constants
  * @{
  */

/** @defgroup CAN_Error_Code CAN Error Code
  * @{
  */
#define DAL_CAN_ERROR_NONE            (0x00000000U)  /*!< No error                                             */
#define DAL_CAN_ERROR_EWG             (0x00000001U)  /*!< Protocol Error Warning                               */
#define DAL_CAN_ERROR_EPV             (0x00000002U)  /*!< Error Passive                                        */
#define DAL_CAN_ERROR_BOF             (0x00000004U)  /*!< Bus-off error                                        */
#define DAL_CAN_ERROR_STF             (0x00000008U)  /*!< Stuff error                                          */
#define DAL_CAN_ERROR_FOR             (0x00000010U)  /*!< Form error                                           */
#define DAL_CAN_ERROR_ACK             (0x00000020U)  /*!< Acknowledgment error                                 */
#define DAL_CAN_ERROR_BR              (0x00000040U)  /*!< Bit recessive error                                  */
#define DAL_CAN_ERROR_BD              (0x00000080U)  /*!< Bit dominant error                                   */
#define DAL_CAN_ERROR_CRC             (0x00000100U)  /*!< CRC error                                            */
#define DAL_CAN_ERROR_RX_FOV0         (0x00000200U)  /*!< Rx FIFO0 overrun error                               */
#define DAL_CAN_ERROR_RX_FOV1         (0x00000400U)  /*!< Rx FIFO1 overrun error                               */
#define DAL_CAN_ERROR_TX_ALST0        (0x00000800U)  /*!< TxMailbox 0 transmit failure due to arbitration lost */
#define DAL_CAN_ERROR_TX_TERR0        (0x00001000U)  /*!< TxMailbox 0 transmit failure due to transmit error   */
#define DAL_CAN_ERROR_TX_ALST1        (0x00002000U)  /*!< TxMailbox 1 transmit failure due to arbitration lost */
#define DAL_CAN_ERROR_TX_TERR1        (0x00004000U)  /*!< TxMailbox 1 transmit failure due to transmit error   */
#define DAL_CAN_ERROR_TX_ALST2        (0x00008000U)  /*!< TxMailbox 2 transmit failure due to arbitration lost */
#define DAL_CAN_ERROR_TX_TERR2        (0x00010000U)  /*!< TxMailbox 2 transmit failure due to transmit error   */
#define DAL_CAN_ERROR_TIMEOUT         (0x00020000U)  /*!< Timeout error                                        */
#define DAL_CAN_ERROR_NOT_INITIALIZED (0x00040000U)  /*!< Peripheral not initialized                           */
#define DAL_CAN_ERROR_NOT_READY       (0x00080000U)  /*!< Peripheral not ready                                 */
#define DAL_CAN_ERROR_NOT_STARTED     (0x00100000U)  /*!< Peripheral not started                               */
#define DAL_CAN_ERROR_PARAM           (0x00200000U)  /*!< Parameter error                                      */

#if USE_DAL_CAN_REGISTER_CALLBACKS == 1
#define DAL_CAN_ERROR_INVALID_CALLBACK (0x00400000U) /*!< Invalid Callback error                               */
#endif /* USE_DAL_CAN_REGISTER_CALLBACKS */
#define DAL_CAN_ERROR_INTERNAL        (0x00800000U)  /*!< Internal error                                       */

/**
  * @}
  */

/** @defgroup CAN_InitStatus CAN InitStatus
  * @{
  */
#define CAN_INITSTATUS_FAILED       (0x00000000U)  /*!< CAN initialization failed */
#define CAN_INITSTATUS_SUCCESS      (0x00000001U)  /*!< CAN initialization OK     */
/**
  * @}
  */

/** @defgroup CAN_operating_mode CAN Operating Mode
  * @{
  */
#define CAN_MODE_NORMAL             (0x00000000U)                                       /*!< Normal mode   */
#define CAN_MODE_LOOPBACK           ((uint32_t)CAN_BITTIM_LBKMEN)                       /*!< Loopback mode */
#define CAN_MODE_SILENT             ((uint32_t)CAN_BITTIM_SILMEN)                       /*!< Silent mode   */
#define CAN_MODE_SILENT_LOOPBACK    ((uint32_t)(CAN_BITTIM_LBKMEN | CAN_BITTIM_SILMEN)) /*!< Loopback combined with silent mode */
/**
  * @}
  */


/** @defgroup CAN_synchronisation_jump_width CAN Synchronization Jump Width
  * @{
  */
#define CAN_SJW_1TQ                 (0x00000000U)                      /*!< 1 time quantum */
#define CAN_SJW_2TQ                 ((uint32_t)CAN_BITTIM_RSYNJW_0)    /*!< 2 time quantum */
#define CAN_SJW_3TQ                 ((uint32_t)CAN_BITTIM_RSYNJW_1)    /*!< 3 time quantum */
#define CAN_SJW_4TQ                 ((uint32_t)CAN_BITTIM_RSYNJW)      /*!< 4 time quantum */
/**
  * @}
  */

/** @defgroup CAN_time_quantum_in_bit_segment_1 CAN Time Quantum in Bit Segment 1
  * @{
  */
#define CAN_BS1_1TQ                 (0x00000000U)                                                                    /*!< 1 time quantum  */
#define CAN_BS1_2TQ                 ((uint32_t)CAN_BITTIM_TIMSEG1_0)                                                 /*!< 2 time quantum  */
#define CAN_BS1_3TQ                 ((uint32_t)CAN_BITTIM_TIMSEG1_1)                                                 /*!< 3 time quantum  */
#define CAN_BS1_4TQ                 ((uint32_t)(CAN_BITTIM_TIMSEG1_1 | CAN_BITTIM_TIMSEG1_0))                        /*!< 4 time quantum  */
#define CAN_BS1_5TQ                 ((uint32_t)CAN_BITTIM_TIMSEG1_2)                                                 /*!< 5 time quantum  */
#define CAN_BS1_6TQ                 ((uint32_t)(CAN_BITTIM_TIMSEG1_2 | CAN_BITTIM_TIMSEG1_0))                        /*!< 6 time quantum  */
#define CAN_BS1_7TQ                 ((uint32_t)(CAN_BITTIM_TIMSEG1_2 | CAN_BITTIM_TIMSEG1_1))                        /*!< 7 time quantum  */
#define CAN_BS1_8TQ                 ((uint32_t)(CAN_BITTIM_TIMSEG1_2 | CAN_BITTIM_TIMSEG1_1 | CAN_BITTIM_TIMSEG1_0)) /*!< 8 time quantum  */
#define CAN_BS1_9TQ                 ((uint32_t)CAN_BITTIM_TIMSEG1_3)                                                 /*!< 9 time quantum  */
#define CAN_BS1_10TQ                ((uint32_t)(CAN_BITTIM_TIMSEG1_3 | CAN_BITTIM_TIMSEG1_0))                        /*!< 10 time quantum */
#define CAN_BS1_11TQ                ((uint32_t)(CAN_BITTIM_TIMSEG1_3 | CAN_BITTIM_TIMSEG1_1))                        /*!< 11 time quantum */
#define CAN_BS1_12TQ                ((uint32_t)(CAN_BITTIM_TIMSEG1_3 | CAN_BITTIM_TIMSEG1_1 | CAN_BITTIM_TIMSEG1_0)) /*!< 12 time quantum */
#define CAN_BS1_13TQ                ((uint32_t)(CAN_BITTIM_TIMSEG1_3 | CAN_BITTIM_TIMSEG1_2))                        /*!< 13 time quantum */
#define CAN_BS1_14TQ                ((uint32_t)(CAN_BITTIM_TIMSEG1_3 | CAN_BITTIM_TIMSEG1_2 | CAN_BITTIM_TIMSEG1_0)) /*!< 14 time quantum */
#define CAN_BS1_15TQ                ((uint32_t)(CAN_BITTIM_TIMSEG1_3 | CAN_BITTIM_TIMSEG1_2 | CAN_BITTIM_TIMSEG1_1)) /*!< 15 time quantum */
#define CAN_BS1_16TQ                ((uint32_t)CAN_BITTIM_TIMSEG1)                                                   /*!< 16 time quantum */
/**
  * @}
  */

/** @defgroup CAN_time_quantum_in_bit_segment_2 CAN Time Quantum in Bit Segment 2
  * @{
  */
#define CAN_BS2_1TQ                 (0x00000000U)                                             /*!< 1 time quantum */
#define CAN_BS2_2TQ                 ((uint32_t)CAN_BITTIM_TIMSEG2_0)                          /*!< 2 time quantum */
#define CAN_BS2_3TQ                 ((uint32_t)CAN_BITTIM_TIMSEG2_1)                          /*!< 3 time quantum */
#define CAN_BS2_4TQ                 ((uint32_t)(CAN_BITTIM_TIMSEG2_1 | CAN_BITTIM_TIMSEG2_0)) /*!< 4 time quantum */
#define CAN_BS2_5TQ                 ((uint32_t)CAN_BITTIM_TIMSEG2_2)                          /*!< 5 time quantum */
#define CAN_BS2_6TQ                 ((uint32_t)(CAN_BITTIM_TIMSEG2_2 | CAN_BITTIM_TIMSEG2_0)) /*!< 6 time quantum */
#define CAN_BS2_7TQ                 ((uint32_t)(CAN_BITTIM_TIMSEG2_2 | CAN_BITTIM_TIMSEG2_1)) /*!< 7 time quantum */
#define CAN_BS2_8TQ                 ((uint32_t)CAN_BITTIM_TIMSEG2)                            /*!< 8 time quantum */
/**
  * @}
  */

